batisteo.vscode-django
cheshirekow.cmake-format
christian-kohler.path-intellisense
codezombiech.gitignore
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
formulahendry.code-runner
github.copilot
github.copilot-chat
josetr.cmake-language-support-vscode
kevinrose.vsc-python-indent
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
njpwerner.autodocstring
redhat.vscode-xml
redhat.vscode-yaml
tamasfe.even-better-toml
twxs.cmake
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
xaver.clang-format
